Revit 2027 API
BuiltInFailures.MEPFabricationFailures.FabricationHangerNotConnectToHost Property
 Fabrication Hanger didn't connect to the %s host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabricationHangerNotConnectToHost { get; }
Public Shared ReadOnly Property FabricationHangerNotConnectToHost As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabricationHangerNotConnectToHost {
	FailureDefinitionId^ get ();
}
static member FabricationHangerNotConnectToHost : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace